#include "led.h"

//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK NANO STM32开发板
//LED驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2018/3/27
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2018-2028
//All rights reserved									  
//////////////////////////////////////////////////////////////////////////////////    
    
//LED IO初始化
void LED_Init(void)
{
	 RCC->APB2ENR|=1<<4;    //使能PORTC时钟	   
	 GPIOC->CRL&=0X00000000; 
	 GPIOC->CRL|=0X33333333;//PC0~7推挽输出   		
     GPIOC->ODR|=(1<<0)|(1<<1)|(1<<2)|(1<<3)|(1<<4)|(1<<5)|(1<<6)|(1<<7);//PC.0~7 输出高电平
}
 
